GreatCowBASIC/DATFileGenerator/incfiles/p18F15Q20.inc
;----- DMA1PR Bits -----------------------------------------------------
PR0_DMA1PR       EQU  H'0000'
PR1_DMA1PR       EQU  H'0001'
PR2_DMA1PR       EQU  H'0002'
PR0_DMA1PR       EQU  H'0000'
PR1_DMA1PR       EQU  H'0001'
PR2_DMA1PR       EQU  H'0002'
DMA1PR0          EQU  H'0000'
DMA1PR1          EQU  H'0001'
DMA1PR2          EQU  H'0002'
DMA1PR0          EQU  H'0000'
DMA1PR1          EQU  H'0001'
DMA1PR2          EQU  H'0002'


;----- CRCCON1 Bits -----------------------------------------------------
PLEN0            EQU  H'0000'
PLEN1            EQU  H'0001'
PLEN2            EQU  H'0002'
PLEN3            EQU  H'0003'
PLEN4            EQU  H'0004'
PLEN0            EQU  H'0000'
PLEN1            EQU  H'0001'
PLEN2            EQU  H'0002'
PLEN3            EQU  H'0003'
PLEN4            EQU  H'0004'


;----- OSCCON1 Bits -----------------------------------------------------
NDIV0            EQU  H'0000'
NDIV1            EQU  H'0001'
NDIV2            EQU  H'0002'
NDIV3            EQU  H'0003'
NOSC0            EQU  H'0004'
NOSC1            EQU  H'0005'
NOSC2            EQU  H'0006'
NDIV0            EQU  H'0000'
NDIV1            EQU  H'0001'
NDIV2            EQU  H'0002'
NDIV3            EQU  H'0003'
NOSC0            EQU  H'0004'
NOSC1            EQU  H'0005'
NOSC2            EQU  H'0006'


;----- I3C1PID1 Bits -----------------------------------------------------
PID8             EQU  H'0000'
PID9             EQU  H'0001'
PID10            EQU  H'0002'
PID11            EQU  H'0003'
PID12            EQU  H'0004'
PID13            EQU  H'0005'
PID14            EQU  H'0006'
PID15            EQU  H'0007'
PID_11_80        EQU  H'0000'
PID_11_81        EQU  H'0001'
PID_11_82        EQU  H'0002'
PID_11_83        EQU  H'0003'
PID_15_120       EQU  H'0004'
PID_15_121       EQU  H'0005'
PID_15_122       EQU  H'0006'
PID_15_123       EQU  H'0007'


;----- I3C1CON0 Bits -----------------------------------------------------
IBIREQ           EQU  H'0000'
HJREQ            EQU  H'0001'
ACKP             EQU  H'0002'
CLRRXB           EQU  H'0003'
CLRTXB           EQU  H'0004'
RST              EQU  H'0005'
BTOEN            EQU  H'0006'
EN               EQU  H'0007'


;----- I3C1CON1 Bits -----------------------------------------------------
ACKPOS           EQU  H'0000'
SASDRMD          EQU  H'0001'
FHDRE            EQU  H'0002'
BERRDET          EQU  H'0003'


;----- I3C1RXB Bits -----------------------------------------------------


;----- I3C1TXB Bits -----------------------------------------------------


;----- I3C1STAT0 Bits -----------------------------------------------------
RNW0             EQU  H'0000'
RNW1             EQU  H'0001'
RXBF             EQU  H'0002'
TXBE             EQU  H'0003'
RSTDET           EQU  H'0004'
OPMD0            EQU  H'0005'
OPMD1            EQU  H'0006'
BFREE            EQU  H'0007'


;----- I3C1STAT1 Bits -----------------------------------------------------
TXFNE            EQU  H'0000'


;----- I3C1BSTAT Bits -----------------------------------------------------
TE0ERR           EQU  H'0000'
TE1ERR           EQU  H'0001'
TE2ERR           EQU  H'0002'
TE3ERR           EQU  H'0003'
TE4ERR           EQU  H'0004'
TE5ERR           EQU  H'0005'
TE6ERR           EQU  H'0006'


;----- I3C1PIR0 Bits -----------------------------------------------------
SCCCIF           EQU  H'0000'
BTFIF            EQU  H'0001'
DADRIF           EQU  H'0002'
SADRIF           EQU  H'0003'
I2CACKIF         EQU  H'0004'
RSCIF            EQU  H'0005'
PCIF             EQU  H'0006'
SCIF             EQU  H'0007'


;----- I3C1PIR1 Bits -----------------------------------------------------
IBIDONEIF        EQU  H'0005'
DACHIF           EQU  H'0006'
TCOMPIF          EQU  H'0007'


;----- I3C1ERRIR0 Bits -----------------------------------------------------
UCCCIF           EQU  H'0000'
BTOIF            EQU  H'0001'
BUSEIF           EQU  H'0002'
IBIEIF           EQU  H'0003'
HJEIF            EQU  H'0004'
RXOIF            EQU  H'0005'
TXUIF            EQU  H'0006'
I2CNACKIF        EQU  H'0007'


;----- I3C1ERRIR1 Bits -----------------------------------------------------
RXREIF           EQU  H'0000'
TXWEIF           EQU  H'0001'
MWLOEIF          EQU  H'0002'
ABEIF            EQU  H'0003'


;----- I3C1PIE0 Bits -----------------------------------------------------
SCCCIE           EQU  H'0000'
BTFIE            EQU  H'0001'
DADRIE           EQU  H'0002'
SADRIE           EQU  H'0003'
I2CACKIE         EQU  H'0004'
RSCIE            EQU  H'0005'
PCIE             EQU  H'0006'
SCIE             EQU  H'0007'


;----- I3C1PIE1 Bits -----------------------------------------------------
IBIDONEIE        EQU  H'0005'
DACHIE           EQU  H'0006'
TCOMPIE          EQU  H'0007'


;----- I3C1ERRIE0 Bits -----------------------------------------------------
UCCCIE           EQU  H'0000'
BTOIE            EQU  H'0001'
BUSEIE           EQU  H'0002'
IBIEIE           EQU  H'0003'
HJEIE            EQU  H'0004'
RXOIE            EQU  H'0005'
TXUIE            EQU  H'0006'
I2CNACKIE        EQU  H'0007'


;----- I3C1ERRIE1 Bits -----------------------------------------------------
RXREIE           EQU  H'0000'
TXWEIE           EQU  H'0001'
MWLOEIE          EQU  H'0002'
ABEIE            EQU  H'0003'


;----- I3C1BIDL Bits -----------------------------------------------------


;----- I3C1BIDLH Bits -----------------------------------------------------


;----- I3C1BAVL Bits -----------------------------------------------------


;----- I3C1BTO Bits -----------------------------------------------------


;----- I3C1BTOH Bits -----------------------------------------------------


;----- I3C1IBIMDB Bits -----------------------------------------------------
IBIMDB_4_00      EQU  H'0000'
IBIMDB_4_01      EQU  H'0001'
IBIMDB_4_02      EQU  H'0002'
IBIMDB_4_03      EQU  H'0003'
IBIMDB_4_04      EQU  H'0004'
IBIMDB_7_50      EQU  H'0005'
IBIMDB_7_51      EQU  H'0006'
IBIMDB_7_52      EQU  H'0007'


;----- I3C1RETRY Bits -----------------------------------------------------


