GreatCowBASIC/DATFileGenerator/incfiles/p18F15Q20.inc
;----- TU16BPRH Bits -----------------------------------------------------
PRH0             EQU  H'0000'
PRH1             EQU  H'0001'
PRH2             EQU  H'0002'
PRH3             EQU  H'0003'
PRH4             EQU  H'0004'
PRH5             EQU  H'0005'
PRH6             EQU  H'0006'
PRH7             EQU  H'0007'
TU16BPRH0        EQU  H'0000'
TU16BPRH1        EQU  H'0001'
TU16BPRH2        EQU  H'0002'
TU16BPRH3        EQU  H'0003'
TU16BPRH4        EQU  H'0004'
TU16BPRH5        EQU  H'0005'
TU16BPRH6        EQU  H'0006'
TU16BPRH7        EQU  H'0007'
TU16BPR8         EQU  H'0000'
TU16BPR9         EQU  H'0001'
TU16BPR10        EQU  H'0002'
TU16BPR11        EQU  H'0003'
TU16BPR12        EQU  H'0004'
TU16BPR13        EQU  H'0005'
TU16BPR14        EQU  H'0006'
TU16BPR15        EQU  H'0007'


;----- TU16BPRT Bits -----------------------------------------------------
PRT0             EQU  H'0000'
PRT1             EQU  H'0001'
PRT2             EQU  H'0002'
PRT3             EQU  H'0003'
PRT4             EQU  H'0004'
PRT5             EQU  H'0005'
PRT6             EQU  H'0006'
PRT7             EQU  H'0007'
TU16BPRT0        EQU  H'0000'
TU16BPRT1        EQU  H'0001'
TU16BPRT2        EQU  H'0002'
TU16BPRT3        EQU  H'0003'
TU16BPRT4        EQU  H'0004'
TU16BPRT5        EQU  H'0005'
TU16BPRT6        EQU  H'0006'
TU16BPRT7        EQU  H'0007'
TU16BPR24        EQU  H'0000'
TU16BPR25        EQU  H'0001'
TU16BPR26        EQU  H'0002'
TU16BPR27        EQU  H'0003'
TU16BPR28        EQU  H'0004'
TU16BPR29        EQU  H'0005'
TU16BPR30        EQU  H'0006'
TU16BPR31        EQU  H'0007'


;----- TU16BCLK Bits -----------------------------------------------------
CLK0             EQU  H'0000'
CLK1             EQU  H'0001'
CLK2             EQU  H'0002'
CLK3             EQU  H'0003'
CLK4             EQU  H'0004'
TU16BCLK0        EQU  H'0000'
TU16BCLK1        EQU  H'0001'
TU16BCLK2        EQU  H'0002'
TU16BCLK3        EQU  H'0003'
TU16BCLK4        EQU  H'0004'


;----- TU16BERS Bits -----------------------------------------------------
ERS0             EQU  H'0000'
ERS1             EQU  H'0001'
ERS2             EQU  H'0002'
ERS3             EQU  H'0003'
ERS4             EQU  H'0004'
ERS5             EQU  H'0005'
TU16BERS0        EQU  H'0000'
TU16BERS1        EQU  H'0001'
TU16BERS2        EQU  H'0002'
TU16BERS3        EQU  H'0003'
TU16BERS4        EQU  H'0004'
TU16BERS5        EQU  H'0005'


;----- CCPTMRS0 Bits -----------------------------------------------------
C1TSEL0          EQU  H'0000'
C1TSEL1          EQU  H'0001'
C2TSEL0          EQU  H'0002'
C2TSEL1          EQU  H'0003'
C1TSEL0          EQU  H'0000'
C1TSEL1          EQU  H'0001'
C2TSEL2          EQU  H'0002'
C2TSEL3          EQU  H'0003'


;----- CCPR2 Bits -----------------------------------------------------


;----- CCPR2H Bits -----------------------------------------------------


;----- CCP2CON Bits -----------------------------------------------------
MODE0            EQU  H'0000'
MODE1            EQU  H'0001'
MODE2            EQU  H'0002'
MODE3            EQU  H'0003'
FMT              EQU  H'0004'
OUT_CCP2CON      EQU  H'0005'
EN               EQU  H'0007'
MODE0            EQU  H'0000'
MODE1            EQU  H'0001'
MODE2            EQU  H'0002'
MODE3            EQU  H'0003'
CCP2MODE0        EQU  H'0000'
CCP2MODE1        EQU  H'0001'
CCP2MODE2        EQU  H'0002'
CCP2MODE3        EQU  H'0003'
CCP2FMT          EQU  H'0004'
CCP2OUT          EQU  H'0005'
CCP2EN           EQU  H'0007'
CCP2MODE0        EQU  H'0000'
CCP2MODE1        EQU  H'0001'
CCP2MODE2        EQU  H'0002'
CCP2MODE3        EQU  H'0003'


;----- CCP2CAP Bits -----------------------------------------------------
CTS0             EQU  H'0000'
CTS1             EQU  H'0001'
CTS2             EQU  H'0002'
CCP2CTS0         EQU  H'0000'
CCP2CTS1         EQU  H'0001'
CCP2CTS2         EQU  H'0002'


;----- PWMLOAD Bits -----------------------------------------------------
MPWM1LD          EQU  H'0000'
MPWM2LD          EQU  H'0001'


;----- PWMEN Bits -----------------------------------------------------
MPWM1EN          EQU  H'0000'
MPWM2EN          EQU  H'0001'


;----- PWM2ERS Bits -----------------------------------------------------
ERS0             EQU  H'0000'
ERS1             EQU  H'0001'
ERS2             EQU  H'0002'
ERS3             EQU  H'0003'


;----- PWM2CLK Bits -----------------------------------------------------
CLK0             EQU  H'0000'
CLK1             EQU  H'0001'
CLK2             EQU  H'0002'
CLK3             EQU  H'0003'


;----- PWM2LDS Bits -----------------------------------------------------
LDS0             EQU  H'0000'
LDS1             EQU  H'0001'
LDS2             EQU  H'0002'
LDS3             EQU  H'0003'


;----- PWM2PR Bits -----------------------------------------------------


;----- PWM2PRH Bits -----------------------------------------------------


;----- PWM2CPRE Bits -----------------------------------------------------


;----- PWM2PIPOS Bits -----------------------------------------------------


;----- PWM2GIR Bits -----------------------------------------------------
S1P1IF           EQU  H'0000'
S1P2IF           EQU  H'0001'


;----- PWM2GIE Bits -----------------------------------------------------
S1P1IE           EQU  H'0000'
S1P2IE           EQU  H'0001'


;----- PWM2CON Bits -----------------------------------------------------
ERSNOW           EQU  H'0000'
ERSPOL           EQU  H'0001'
LD_PWM2CON       EQU  H'0002'
EN               EQU  H'0007'


;----- PWM2S1CFG Bits -----------------------------------------------------
MODE0            EQU  H'0000'
MODE1            EQU  H'0001'
MODE2            EQU  H'0002'
PPEN             EQU  H'0003'
POL1             EQU  H'0006'
POL2             EQU  H'0007'
MODE0            EQU  H'0000'
MODE1            EQU  H'0001'
MODE2            EQU  H'0002'


;----- PWM2S1P1 Bits -----------------------------------------------------


;----- PWM2S1P1H Bits -----------------------------------------------------


;----- PWM2S1P2 Bits -----------------------------------------------------


;----- PWM2S1P2H Bits -----------------------------------------------------


;----- CWG1CLK Bits -----------------------------------------------------
CS_CWG1CLK       EQU  H'0000'
CWG1CS           EQU  H'0000'


;----- CWG1ISM Bits -----------------------------------------------------
ISM0             EQU  H'0000'
ISM1             EQU  H'0001'
ISM2             EQU  H'0002'
ISM3             EQU  H'0003'
ISM4             EQU  H'0004'


;----- CWG1DBR Bits -----------------------------------------------------
DBR0             EQU  H'0000'
DBR1             EQU  H'0001'
DBR2             EQU  H'0002'
DBR3             EQU  H'0003'
DBR4             EQU  H'0004'
DBR5             EQU  H'0005'
CWG1DBR0         EQU  H'0000'
CWG1DBR1         EQU  H'0001'
CWG1DBR2         EQU  H'0002'
CWG1DBR3         EQU  H'0003'
CWG1DBR4         EQU  H'0004'
CWG1DBR5         EQU  H'0005'


