GreatCowBASIC/DATFileGenerator/incfiles/p18F15Q20.inc
;----- ADCON3 Bits -----------------------------------------------------
TMD0             EQU  H'0000'
TMD1             EQU  H'0001'
TMD2             EQU  H'0002'
SOI              EQU  H'0003'
CALC0            EQU  H'0004'
CALC1            EQU  H'0005'
CALC2            EQU  H'0006'
ADTMD0           EQU  H'0000'
ADTMD1           EQU  H'0001'
ADTMD2           EQU  H'0002'
ADSOI            EQU  H'0003'
ADCALC0          EQU  H'0004'
ADCALC1          EQU  H'0005'
ADCALC2          EQU  H'0006'
ADTMD0           EQU  H'0000'
ADTMD1           EQU  H'0001'
ADTMD2           EQU  H'0002'
ADCALC0          EQU  H'0004'
ADCALC1          EQU  H'0005'
ADCALC2          EQU  H'0006'
TMD0             EQU  H'0000'
TMD1             EQU  H'0001'
TMD2             EQU  H'0002'
CALC0            EQU  H'0004'
CALC1            EQU  H'0005'
CALC2            EQU  H'0006'


;----- ADSTAT Bits -----------------------------------------------------
STAT0_ADSTAT     EQU  H'0000'
STAT1_ADSTAT     EQU  H'0001'
STAT2            EQU  H'0002'
MATH             EQU  H'0004'
LTHR             EQU  H'0005'
UTHR             EQU  H'0006'
AOV              EQU  H'0007'
ADSTAT0          EQU  H'0000'
ADSTAT1          EQU  H'0001'
ADSTAT2          EQU  H'0002'
ADMATH           EQU  H'0004'
ADLTHR           EQU  H'0005'
ADUTHR           EQU  H'0006'
ADAOV            EQU  H'0007'
ADSTAT0          EQU  H'0000'
ADSTAT1          EQU  H'0001'
ADSTAT2          EQU  H'0002'
ADOV             EQU  H'0007'
STAT0_ADSTAT     EQU  H'0000'
STAT1_ADSTAT     EQU  H'0001'
STAT2            EQU  H'0002'
OV_ADSTAT        EQU  H'0007'


;----- ADREF Bits -----------------------------------------------------
PREF0            EQU  H'0000'
PREF1            EQU  H'0001'
PREF2            EQU  H'0002'
PREF3            EQU  H'0003'
NREF0            EQU  H'0004'
NREF1            EQU  H'0005'
NREF2            EQU  H'0006'
NREF3            EQU  H'0007'
ADPREF0          EQU  H'0000'
ADPREF1          EQU  H'0001'
ADPREF2          EQU  H'0002'
ADPREF3          EQU  H'0003'
ADNREF0          EQU  H'0004'
ADNREF1          EQU  H'0005'
ADNREF2          EQU  H'0006'
ADNREF3          EQU  H'0007'
PREF0            EQU  H'0000'
PREF1            EQU  H'0001'
NREF0            EQU  H'0004'
ADPREF0          EQU  H'0000'
ADPREF1          EQU  H'0001'
ADNREF0          EQU  H'0004'


;----- ADACT Bits -----------------------------------------------------
ADACT0           EQU  H'0000'
ADACT1           EQU  H'0001'
ADACT2           EQU  H'0002'
ADACT3           EQU  H'0003'
ADACT4           EQU  H'0004'
ADACT5           EQU  H'0005'
ACT0             EQU  H'0000'
ACT1             EQU  H'0001'
ACT2             EQU  H'0002'
ACT3             EQU  H'0003'
ACT4             EQU  H'0004'
ACT5             EQU  H'0005'


;----- ADCLK Bits -----------------------------------------------------
ADCS0            EQU  H'0000'
ADCS1            EQU  H'0001'
ADCS2            EQU  H'0002'
ADCS3            EQU  H'0003'
ADCS4            EQU  H'0004'
ADCS5            EQU  H'0005'
CS0_ADCLK        EQU  H'0000'
CS1_ADCLK        EQU  H'0001'
CS2_ADCLK        EQU  H'0002'
CS3              EQU  H'0003'
CS4              EQU  H'0004'
CS5              EQU  H'0005'


;----- ADCG1A Bits -----------------------------------------------------
CGA0             EQU  H'0000'
CGA1             EQU  H'0001'
CGA2             EQU  H'0002'
CGA4             EQU  H'0004'
CGA5             EQU  H'0005'


;----- ADCG1B Bits -----------------------------------------------------
CGB5             EQU  H'0005'
CGB6             EQU  H'0006'
CGB7             EQU  H'0007'


;----- ADCG1C Bits -----------------------------------------------------
CGC0             EQU  H'0000'
CGC1             EQU  H'0001'
CGC3             EQU  H'0003'
CGC4             EQU  H'0004'
CGC5             EQU  H'0005'
CGC6             EQU  H'0006'
CGC7             EQU  H'0007'


;----- PMD0 Bits -----------------------------------------------------
DMA1MD           EQU  H'0000'
DMA2MD           EQU  H'0001'
DMA3MD           EQU  H'0002'
DMA4MD           EQU  H'0003'
CRCMD            EQU  H'0005'
SCANMD           EQU  H'0006'
SYSCMD           EQU  H'0007'


;----- PMD2 Bits -----------------------------------------------------
TU16AMD          EQU  H'0000'
TU16BMD          EQU  H'0001'
CCP1MD           EQU  H'0002'
CCP2MD           EQU  H'0003'
PWM1MD           EQU  H'0004'
PWM2MD           EQU  H'0005'
CWG1MD           EQU  H'0006'
CLC1MD           EQU  H'0007'


;----- PMD3 Bits -----------------------------------------------------
CLC2MD           EQU  H'0000'
CLC3MD           EQU  H'0001'
CLC4MD           EQU  H'0002'
U1MD             EQU  H'0003'
U2MD             EQU  H'0004'
SPI1MD_PMD3      EQU  H'0005'
I2C1MD           EQU  H'0006'
I3C1MD           EQU  H'0007'


;----- PMD4 Bits -----------------------------------------------------
I3C2MD           EQU  H'0000'
FVRMD            EQU  H'0001'
HLVDMD           EQU  H'0002'
ADCMD            EQU  H'0003'


;----- RB5FEAT Bits -----------------------------------------------------
SYSBUF0          EQU  H'0000'
SYSBUF1          EQU  H'0001'
SYSBUF2          EQU  H'0002'
I3CBUF0          EQU  H'0003'
I3CBUF1          EQU  H'0004'
I3CBUF2          EQU  H'0005'
SLEW0            EQU  H'0006'
SLEW1            EQU  H'0007'


;----- RB6FEAT Bits -----------------------------------------------------
SYSBUF0          EQU  H'0000'
SYSBUF1          EQU  H'0001'
SYSBUF2          EQU  H'0002'
I3CBUF0          EQU  H'0003'
I3CBUF1          EQU  H'0004'
I3CBUF2          EQU  H'0005'
SLEW0            EQU  H'0006'
SLEW1            EQU  H'0007'


;----- RC0FEAT Bits -----------------------------------------------------
SYSBUF0          EQU  H'0000'
SYSBUF1          EQU  H'0001'
SYSBUF2          EQU  H'0002'
I3CBUF0          EQU  H'0003'
I3CBUF1          EQU  H'0004'
I3CBUF2          EQU  H'0005'
SLEW0            EQU  H'0006'
SLEW1            EQU  H'0007'


;----- RC4FEAT Bits -----------------------------------------------------
SYSBUF0          EQU  H'0000'
SYSBUF1          EQU  H'0001'
SLEW0            EQU  H'0006'
SLEW1            EQU  H'0007'


